app/controllers/websites_controller.rb

    def create
        variables = params[:post]

        website = Website.find(1)
---
SELECT  "websites".* FROM "websites" WHERE "websites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]