app/controllers/websites_controller.rb

SELECT  "websites".* FROM "websites" WHERE "websites"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        @website = Website.find(params[:format])

INSERT INTO "websites" ("hours", "minutes", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["hours", 2], ["minutes", 57], ["created_at", "2017-10-10 08:02:45.321088"], ["updated_at", "2017-10-10 08:02:45.321088"]]
---
    def create
        @website = Website.new
        variables = params[:post]

        # Calculates work duration in minutes
        current_time = Time.now
        current_time_in_minutes = (current_time.hour * 60) + current_time.min
        finish_time_in_minutes = (variables["hours"].to_i * 60) + variables["minutes"].to_i
        total_time = finish_time_in_minutes - current_time_in_minutes


        # Breaking the time into sessions
        data = session_breaker(total_time)
        p data
        remaining_time = (data[:remaining]/ (data[:work]*2)-1)

        # Set the data into the Website object and save it to the FB
        @website.sessions = data[:work]
        @website.work_seconds = (remaining_time + 25) * 60
        @website.break_seconds = (remaining_time + 5) * 60
        @website.save